# 4.9 Part 1- Intro to Data Visualization with Python (TASK)

In [1]:
#Importing libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
#Importing customer dataframe

df_customer = pd.read_csv(r'/Users/dorinasalam/Desktop/08-2023 Instacart Basket Analysis/02 Data/Original Data/customers.csv')

In [3]:
df_customer.head(15)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072
10,26441,Gloria,Stafford,Female,Nevada,19,1/1/2017,2,living with parents and siblings,43443
11,33835,Roger,Casey,Male,Nebraska,45,1/1/2017,2,married,47988
12,75032,Cynthia,Mcdaniel,Female,Georgia,75,1/1/2017,1,married,57835
13,51,Stephanie,Jensen,Female,Wyoming,37,1/1/2017,1,married,71190
14,516,Peter,Hunt,Male,Colorado,51,1/1/2017,2,married,146559

In [4]:
df_customer.shape

(206209, 10)

In [5]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

### First name column looks like it contains null values.

In [6]:
df_customer.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [7]:
#Subsetting dataframe to exclude unnecessary columns. *This method was used to avoid dropping from orginal dataframe. 

df_customer_2 = df_customer[['user_id','Gender','STATE','Age','n_dependants','fam_status','income']]

#### The column names seem reasonable. They were not changed.

In [8]:
#Checking for mixed-type data

for col in df_customer_2.columns.tolist():
  weird = (df_customer_2[[col]].applymap(type) != df_customer_2[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customer_2[weird]) > 0:
    print (col)

### No mixed-type data found.

In [9]:
#Checking for null values

df_customer_2.isnull().sum()

user_id         0
Gender          0
STATE           0
Age             0
n_dependants    0
fam_status      0
income          0
dtype: int64

### No null values in subset df

In [10]:
#Checking for duplicates/saving any duplicates in a new df

df_dups = df_customer_2[df_customer_2.duplicated()]

In [11]:
#Checking df_dups for duplicates

df_dups

Empty DataFrame
Columns: [user_id, Gender, STATE, Age, n_dependants, fam_status, income]
Index: []

### No duplicates found in subset df

In [12]:
df_customer_2.shape

(206209, 7)

In [13]:
df_prods_ords = pd.read_pickle(r'/Users/dorinasalam/Desktop/08-2023 Instacart Basket Analysis/02 Data/Prepared Data/orders_products_customer.pkl')

In [14]:
df_prods_ords.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 23 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int64
 1   product_name            object
 2   aisle_id                int64
 3   department_id           int64
 4   prices                  float64
 5   order_id                int64
 6   user_id                 int64
 7   order_number            int64
 8   orders_day_of_week      int64
 9   order_hour_of_day       int64
 10  days_since_prior_order  float64
 11  add_to_cart_order       int64
 12  reordered               int64
 13  _merge                  category
 14  price_range_loc         object
 15  busiest_day             object
 16  busiest_period_of_day   object
 17  max_order               int64
 18  loyalty_flag            object
 19  mean_price              float64
 20  spender_flag            object
 21  median_frequency        float64
 22  frequency_flag          object
dtypes: category(1), float64(4), int64(11), object(7)
memory usage: 5.6+ GB

In [15]:
df_prods_ords = df_prods_ords.drop(columns = ['_merge','mean_price','median_frequency'])

In [16]:
df_prods_ords.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 20 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int64
 1   product_name            object
 2   aisle_id                int64
 3   department_id           int64
 4   prices                  float64
 5   order_id                int64
 6   user_id                 int64
 7   order_number            int64
 8   orders_day_of_week      int64
 9   order_hour_of_day       int64
 10  days_since_prior_order  float64
 11  add_to_cart_order       int64
 12  reordered               int64
 13  price_range_loc         object
 14  busiest_day             object
 15  busiest_period_of_day   object
 16  max_order               int64
 17  loyalty_flag            object
 18  spender_flag            object
 19  frequency_flag          object
dtypes: float64(2), int64(11), object(7)
memory usage: 5.1+ GB

In [17]:
df_prods_ords_cust_merged = df_prods_ords.merge(df_customer_2, on = ['user_id'], how = 'left')

In [18]:
df_prods_ords_cust_merged.to_pickle(r'/Users/dorinasalam/Desktop/08-2023 Instacart Basket Analysis/02 Data/Prepared Data/ords_prods_cust_merged.pkl')